Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs-shipyard</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_membership.this["djmcquillan"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "djmcquillan"
    }

  # github_membership.this["tinytb"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "tinytb"
    }

  # github_membership.this["whizzzkid"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "whizzzkid"
    }

  # github_repository.this["ipfs-thing-2023"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "ipfs-þing-2023"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "ipfs-thing-2023"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

  # github_repository_collaborator.this["ipfs-thing-2023:autonome"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "ipfs-thing-2023"
      + username                    = "autonome"
    }

  # github_repository_collaborator.this["ipfs-thing-2023:b5"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "ipfs-thing-2023"
      + username                    = "b5"
    }

  # github_repository_collaborator.this["ipfs-thing-2023:bmann"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "ipfs-thing-2023"
      + username                    = "bmann"
    }

  # github_repository_collaborator.this["ipfs-thing-2023:hannahhoward"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "ipfs-thing-2023"
      + username                    = "hannahhoward"
    }

  # github_repository_collaborator.this["ipfs-thing-2023:mishmosh"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "ipfs-thing-2023"
      + username                    = "mishmosh"
    }

  # github_repository_collaborator.this["ipfs-thing-2023:sgtpooki"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "ipfs-thing-2023"
      + username                    = "SgtPooki"
    }

  # github_repository_collaborator.this["ipfs-thing-2023:willscott"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "ipfs-thing-2023"
      + username                    = "willscott"
    }

  # github_team_membership.this["gui:djmcquillan"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "2593761"
      + username = "djmcquillan"
    }

  # github_team_membership.this["gui:sgtpooki"] will be updated in-place
  ~ resource "github_team_membership" "this" {
        id       = "2593761:SgtPooki"
      ~ role     = "member" -> "maintainer"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.this["gui:tinytb"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "2593761"
      + username = "tinytb"
    }

  # github_team_membership.this["gui:whizzzkid"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "2593761"
      + username = "whizzzkid"
    }

Plan: 14 to add, 1 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->